In [1]:
import pandas as pd

In [2]:
df = pd.read_html('http://sos.ga.gov/elections/election_results/2006_1107/005.htm')

In [3]:
df = df[0]

In [4]:
df.head(5)

,0,1,2,3,4,5
0,NaN,NaN,NaN,"Cagle (R) 1,134,517","Martin (D) 887,506","Buckley (Lib) 75,673"
1,NaN,NaN,NaN,54.1%,42.3%,3.6%
2,County,PR,TP,NaN,NaN,NaN
3,APPLING,19,19,2575,1346,65
4,ATKINSON,6,6,824,566,31

In [5]:
df = df[3:]

In [6]:
df.head(5)

          0   1   2     3     4    5
3   APPLING  19  19  2575  1346   65
4  ATKINSON   6   6   824   566   31
5     BACON   7   7  1335   849   47
6     BAKER   7   7   400   525   20
7   BALDWIN  16  16  4596  5029  273

In [7]:
df = df.drop(df.columns[[1,2]], axis=1)

In [8]:
df.head(5)

          0     3     4    5
3   APPLING  2575  1346   65
4  ATKINSON   824   566   31
5     BACON  1335   849   47
6     BAKER   400   525   20
7   BALDWIN  4596  5029  273

In [9]:
df.columns = ['county', 'Casey Cagle', 'Jim Martin', 'Allen Buckley']

In [10]:
df.tail(5)

        county Casey Cagle Jim Martin Allen Buckley
157  WHITFIELD       11147       4811           429
158     WILCOX        1159        752            19
159     WILKES        1417       1197            74
160  WILKINSON        1226       1520            56
161      WORTH        3113       1731            87

In [11]:
df = df.melt(id_vars=['county'])

In [13]:
df.columns = ['county', 'candidate', 'votes']

In [14]:
df.head()

     county    candidate votes
0   APPLING  Casey Cagle  2575
1  ATKINSON  Casey Cagle   824
2     BACON  Casey Cagle  1335
3     BAKER  Casey Cagle   400
4   BALDWIN  Casey Cagle  4596

In [16]:
df.to_clipboard(index=False)

In [ ]:
df.to_csv('governor.csv', index=False)